tutorials/fluidSolidInteraction/explicitGodunovCC/perpendicularFlap/0/solid/lm_b
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      lm_b;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -2 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    interface
    {
        type            explicitSolidTractionLinearMomentum;
        traction        uniform ( 0 0 0 );
        pressure        uniform 0;
        value           uniform (0 0 0);
    }
    bottom
    {
        type    fixedValue;
        value   uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }

}

// ************************************************************************* //
